module.exports = {
  title: "Java 编程思想",
  base: "/thinking-in-java-zh/",
  themeConfig: {
    sidebar: [
      "0.1",
      "0.2",
      {
        title: "第1章 对象入门", // 必要的
        path: "1", // 可选的, 标题的跳转链接，应为绝对路径且必须存在
        collapsable: false, // 可选的, 默认值是 true,
        sidebarDepth: 1, // 可选的, 默认值是 1
        children: [
          "1.1",
          "1.2",
          "1.3",
          "1.4",
          "1.5",
          "1.6",
          "1.7",
          "1.8",
          "1.9",
          "1.10",
          "1.11",
          "1.12",
          "1.13",
        ],
      },
      {
        title: "第2章 一切都是对象", // 必要的
        path: "2", // 可选的, 标题的跳转链接，应为绝对路径且必须存在
        collapsable: false, // 可选的, 默认值是 true,
        sidebarDepth: 1, // 可选的, 默认值是 1
        children: [
          "2.1",
          "2.2",
          "2.3",
          "2.4",
          "2.5",
          "2.6",
          "2.7",
          "2.8",
          "2.9",
          "2.10",
          "2.11",
        ],
      },
      {
        title: "第3章 控制程序流程", // 必要的
        path: "3", // 可选的, 标题的跳转链接，应为绝对路径且必须存在
        collapsable: false, // 可选的, 默认值是 true,
        sidebarDepth: 1, // 可选的, 默认值是 1
        children: ["3.1", "3.2", "3.3", "3.4"],
      },
      {
        title: "第4章 初始化和清除", // 必要的
        path: "4", // 可选的, 标题的跳转链接，应为绝对路径且必须存在
        collapsable: false, // 可选的, 默认值是 true,
        sidebarDepth: 1, // 可选的, 默认值是 1
        children: ["4.1", "4.2", "4.3", "4.4", "4.5", "4.6", "4.7"],
      },
      {
        title: "第5章 隐藏实现过程", // 必要的
        path: "5", // 可选的, 标题的跳转链接，应为绝对路径且必须存在
        collapsable: false, // 可选的, 默认值是 true,
        sidebarDepth: 1, // 可选的, 默认值是 1
        children: ["5.1", "5.2", "5.3", "5.4", "5.5", "5.6"],
      },
      {
        title: "第6章 类复用", // 必要的
        path: "6", // 可选的, 标题的跳转链接，应为绝对路径且必须存在
        collapsable: false, // 可选的, 默认值是 true,
        sidebarDepth: 1, // 可选的, 默认值是 1
        children: [
          "6.1",
          "6.2",
          "6.3",
          "6.4",
          "6.5",
          "6.6",
          "6.7",
          "6.8",
          "6.9",
          "6.10",
          "6.11",
        ],
      },
      {
        title: "第7章 多态性", // 必要的
        path: "7", // 可选的, 标题的跳转链接，应为绝对路径且必须存在
        collapsable: false, // 可选的, 默认值是 true,
        sidebarDepth: 1, // 可选的, 默认值是 1
        children: [
          "7.1",
          "7.2",
          "7.3",
          "7.4",
          "7.5",
          "7.6",
          "7.7",
          "7.8",
          "7.9",
          "7.10",
        ],
      },
      {
        title: "第8章 对象的容纳", // 必要的
        path: "8", // 可选的, 标题的跳转链接，应为绝对路径且必须存在
        collapsable: false, // 可选的, 默认值是 true,
        sidebarDepth: 1, // 可选的, 默认值是 1
        children: [
          "8.1",
          "8.2",
          "8.3",
          "8.4",
          "8.5",
          "8.6",
          "8.7",
          "8.8",
          "8.9",
        ],
      },
      {
        title: "第9章 异常差错控制", // 必要的
        path: "9", // 可选的, 标题的跳转链接，应为绝对路径且必须存在
        collapsable: false, // 可选的, 默认值是 true,
        sidebarDepth: 1, // 可选的, 默认值是 1
        children: [
          "9.1",
          "9.2",
          "9.3",
          "9.4",
          "9.5",
          "9.6",
          "9.7",
          "9.8",
          "9.9",
          "9.10",
        ],
      },
      {
        title: "第10章 Java IO系统", // 必要的
        path: "10", // 可选的, 标题的跳转链接，应为绝对路径且必须存在
        collapsable: false, // 可选的, 默认值是 true,
        sidebarDepth: 1, // 可选的, 默认值是 1
        children: [
          "10.1",
          "10.2",
          "10.3",
          "10.4",
          "10.5",
          "10.6",
          "10.7",
          "10.8",
          "10.9",
          "10.10",
          "10.11",
        ],
      },
      {
        title: "第11章 运行期类型识别", // 必要的
        path: "11", // 可选的, 标题的跳转链接，应为绝对路径且必须存在
        collapsable: false, // 可选的, 默认值是 true,
        sidebarDepth: 1, // 可选的, 默认值是 1
        children: ["11.1", "11.2", "11.3", "11.4", "11.5"],
      },
      {
        title: "第12章 传递和返回对象", // 必要的
        path: "12", // 可选的, 标题的跳转链接，应为绝对路径且必须存在
        collapsable: false, // 可选的, 默认值是 true,
        sidebarDepth: 1, // 可选的, 默认值是 1
        children: ["12.1", "12.2", "12.3", "12.4", "12.5", "12.6"],
      },
      {
        title: "第13章 创建窗口和程序片", // 必要的
        path: "13", // 可选的, 标题的跳转链接，应为绝对路径且必须存在
        collapsable: false, // 可选的, 默认值是 true,
        sidebarDepth: 1, // 可选的, 默认值是 1
        children: [
          "13.1",
          "13.2",
          "13.3",
          "13.4",
          "13.5",
          "13.6",
          "13.7",
          "13.8",
          "13.9",
          "13.10",
          "13.11",
          "13.12",
          "13.13",
          "13.14",
          "13.15",
          "13.16",
          "13.17",
          "13.18",
          "13.19",
          "13.20",
          "13.21",
        ],
      },
      {
        title: "第14章 多线程", // 必要的
        path: "14", // 可选的, 标题的跳转链接，应为绝对路径且必须存在
        collapsable: false, // 可选的, 默认值是 true,
        sidebarDepth: 1, // 可选的, 默认值是 1
        children: ["14.1", "14.2", "14.3", "14.4", "14.5", "14.6", "14.7"],
      },
      {
        title: "第15章 网络编程", // 必要的
        path: "15", // 可选的, 标题的跳转链接，应为绝对路径且必须存在
        collapsable: false, // 可选的, 默认值是 true,
        sidebarDepth: 1, // 可选的, 默认值是 1
        children: [
          "15.1",
          "15.2",
          "15.3",
          "15.4",
          "15.5",
          "15.6",
          "15.7",
          "15.8",
          "15.9",
        ],
      },
      {
        title: "第16章 设计模式", // 必要的
        path: "16", // 可选的, 标题的跳转链接，应为绝对路径且必须存在
        collapsable: false, // 可选的, 默认值是 true,
        sidebarDepth: 1, // 可选的, 默认值是 1
        children: [
          "16.1",
          "16.2",
          "16.3",
          "16.4",
          "16.5",
          "16.6",
          "16.7",
          "16.8",
          "16.9",
          "16.10",
        ],
      },
      {
        title: "第17章 项目", // 必要的
        path: "17", // 可选的, 标题的跳转链接，应为绝对路径且必须存在
        collapsable: false, // 可选的, 默认值是 true,
        sidebarDepth: 1, // 可选的, 默认值是 1
        children: ["17.1", "17.2", "17.3", "17.4", "17.5"],
      },
      "a",
      "b",
      "c",
      "d",
      "e",
      "f",
    ],
  },
};
